---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetLayoutRule
source: html/9948e798-a1d6-6ab0-cd94-57f4e99a9206.htm
---
# Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetLayoutRule Method

Gets the layout rule for this bar.

## Syntax (C#)
```csharp
public RebarLayoutRule GetLayoutRule()
```

## Returns
Returns the layout rule for this bar.